public/man/man1/newuidmap.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - newuidmap.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - newuidmap.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>newuidmap - set the uid mapping of a user namespace</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>newuidmap</strong> <em>pid</em> <em>uid</em> <em>loweruid</em> <em>count</em> [/uid/ <em>loweruid</em> <em>count</em> [
<em>…</em> ]]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <strong>newuidmap</strong> sets <em>proc</em>[pid]/uid_map based on its command line
arguments and the uids allowed. Subuid delegation can either be managed
via /etc/subuid or through the configured NSS subid module. These
options are mutually exclusive.</p>
<p>
Note that the root user is not exempted from the requirement for a valid
/etc/subuid entry.</p>
<p>
After the pid argument, <strong>newuidmap</strong> expects sets of 3 integers:</p>
<p>
uid</p>
<blockquote>
<p>Beginning of the range of UIDs inside the user namespace.</p>
</blockquote>
<p>
loweruid</p>
<blockquote>
<p>Beginning of the range of UIDs outside the user namespace.</p>
</blockquote>
<p>
count</p>
<blockquote>
<p>Length of the ranges (both inside and outside the user namespace).</p>
</blockquote>
<p>
<strong>newuidmap</strong> verifies that the caller is the owner of the process
indicated by <strong>pid</strong> and that for each of the above sets, each of the UIDs
in the range [loweruid, loweruid+count) is allowed to the caller
according to <em>etc/subuid before setting /proc</em>[pid]/uid_map.</p>
<p>
Note that newuidmap may be used only once for a given process.</p>
<p>
Instead of an integer process id, the first argument may be specified as
<em>fd:N</em>, where the integer N is the file descriptor number for the
calling processs opened file descriptor for the directory <em>proc</em>[pid].
In this case, <strong>newuidmap</strong> will use openat(2) to open the uid_map file
under that directory, avoiding a TOCTTOU in case the process exits and
the pid is immediately reused.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>There currently are no options to the <strong>newuidmap</strong> command.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
FILES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>/etc/subuid</p>
<blockquote>
<p>List of users subordinate user IDs.</p>
</blockquote>
<p>
<em>proc</em>[pid]/uid_map</p>
<blockquote>
<p>Mapping of uids from one between user namespaces.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*login.defs*(5), *newusers*(8), *subuid*(5), *useradd*(8), *usermod*(8),
*userdel*(8).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
